{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"keras_tensor_62": {"name": "keras_tensor_62:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_9_1/conv2d_10_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_10_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_11_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_11_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_12_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_12_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/flatten_4_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_8_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4608"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_8_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_9_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_9_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_62", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_10_1/add", "op": "_FusedConv2D", "input": ["keras_tensor_62", "StatefulPartitionedCall/sequential_9_1/conv2d_10_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_9_1/conv2d_10_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_9_1/max_pooling2d_10_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_9_1/conv2d_10_1/add"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_10_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_9_1/max_pooling2d_10_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_11_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_9_1/conv2d_10_1/Relu", "StatefulPartitionedCall/sequential_9_1/conv2d_11_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_9_1/conv2d_11_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-8"}, {"size": "-12"}, {"size": "-13"}, {"size": "-14"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_9_1/max_pooling2d_11_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_9_1/conv2d_11_1/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_11_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_9_1/max_pooling2d_11_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_12_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_9_1/conv2d_11_1/Relu", "StatefulPartitionedCall/sequential_9_1/conv2d_12_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_9_1/conv2d_12_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-17"}, {"size": "-21"}, {"size": "-22"}, {"size": "-23"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_9_1/max_pooling2d_12_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_9_1/conv2d_12_1/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_12_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_9_1/max_pooling2d_12_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/flatten_4_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_9_1/conv2d_12_1/Relu", "StatefulPartitionedCall/sequential_9_1/flatten_4_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_8_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_9_1/flatten_4_1/Reshape", "StatefulPartitionedCall/sequential_9_1/dense_8_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_9_1/dense_8_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_9_1/Sigmoid", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_9_1/dense_8_1/Relu", "StatefulPartitionedCall/sequential_9_1/dense_9_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_9_1/dense_9_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "U2lnbW9pZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_9_1/dense_9_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_9_1/conv2d_10_1/convolution/ReadVariableOp", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_10_1/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_11_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_11_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_12_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/conv2d_12_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/flatten_4_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_8_1/Cast/ReadVariableOp", "shape": [4608, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_8_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_9_1/Cast/ReadVariableOp", "shape": [128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_9_1/dense_9_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}